//=============================================================================
// FileName: deviceDX.h
// Author: SHUN SAKAI
// Content: DirectX用のデバイス
//=============================================================================

//*****************************************************************************
// IncludeGurd
//*****************************************************************************
#ifndef _RENDER_TARGET_H_
#define _RENDER_TARGET_H_

//*****************************************************************************
// Include
//*****************************************************************************
#include "d3dx9.h"

//*****************************************************************************
// Link
//*****************************************************************************

//*****************************************************************************
// Macro
//*****************************************************************************

//*****************************************************************************
// Tag
//*****************************************************************************

//*****************************************************************************
// Class
//*****************************************************************************
class Texture;
class RenderTarget{
public:
	//=============================================================================
	// FunctionName: Constructor
	// Param: void
	// ReturnValue: void
	// Content: コンストラクタであり引数のプライオリティで描画順番が決まる
	//			全てのメンバ変数はここで初期化をしておくこと
	//=============================================================================
	RenderTarget();	// コンストラクタ
	//=============================================================================
	// FunctionName: Destructor
	// Param: void
	// ReturnValue: void
	// Content: 各種動的に確保したバッファなどの開放処理を行う
	//=============================================================================
	~RenderTarget();// デストラクタ
	//=============================================================================
	// FunctionName: Init
	// Param: デバイス
	// Param: 幅
	// Param: 高さ
	// ReturnValue: 成功したかどうか
	// Content: 初期化
	//=============================================================================
	bool Init(LPDIRECT3DDEVICE9 paramDevice9,
		float paramWidth,
		float paramHeight);
	//=============================================================================
	// FunctionName: SetRenderTarget
	// Param: デバイス
	// Param: 設定するレンダーターゲットの番号
	// ReturnValue: 成功したかどうか
	// Content: レンダーターゲットの設定
	//=============================================================================
	bool SetRenderTarget(LPDIRECT3DDEVICE9 paramDevice9, DWORD paramSetIndex);

	//=============================================================================
	// FunctionName: ReleaseRenderTarget
	// Param: デバイス
	// Param: 解除するレンダーターゲットの番号
	// ReturnValue: 成功したかどうか
	// Content: レンダーターゲットの解除
	//=============================================================================
	bool ReleaseRenderTarget(LPDIRECT3DDEVICE9 paramDevice9, DWORD paramSetIndex);

	//=============================================================================
	// FunctionName: GetRenderTarget
	// Param: デバイス
	// Param: 解除するレンダーターゲットの番号
	// ReturnValue: 成功したかどうか
	// Content: レンダーターゲットの取得
	//=============================================================================
	bool GetRenderTarget(LPDIRECT3DDEVICE9 paramDevice9, DWORD paramSetIndex);

	LPDIRECT3DTEXTURE9 GetTexBuff();
	IDirect3DSurface9* GetTexSurface(){ return surface; };

	//=============================================================================
	// Getter
	//=============================================================================

private:
	//=============================================================================
	// VariableDefinition
	//=============================================================================
	Texture* tex;
	LPDIRECT3DTEXTURE9 texBuff;		// テクスチャへのポインタ
	IDirect3DSurface9* surface;

};// RenderTarget
//*****************************************************************************
// IncludeGurd
//*****************************************************************************
#endif// _DISP_STATE_H_

// EOF