//=============================================================================
//
// MS_BuildFight [debugproc.cpp]
// 15/08/20
// Author : YOSHIKI ITOU
//
//=============================================================================
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include "../common.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// デバッグ処理クラス
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();

	void Init(LPDIRECT3DDEVICE9 pDevice);
	void Uninit(void);

	static void Print(char *fmt,...);		//描画する文字の設定
	static void Draw(void);

	static bool IsEnableDisp(void){ return m_bDisp; }	//描画されているかの受け渡し
	static void dsxzxEnableDisp(bool bDisp){ m_bDisp = bDisp; }

private:
	static LPD3DXFONT m_pD3DXFont;
	static char m_aStr[1028];

	static bool m_bDisp;
};

#endif