//=============================================================================
// FileName: entityFactory.hpp
// Author: SHUN SAKAI
// Content: オブジェクトの生成
//=============================================================================

//*****************************************************************************
// IncludeGurd
//*****************************************************************************
#ifndef _ENTITY_FACTORY_HPP_
#define _ENTITY_FACTORY_HPP_

//*****************************************************************************
// Include
//*****************************************************************************
#include "d3dx9.h"

//*****************************************************************************
// Link
//*****************************************************************************

//*****************************************************************************
// Macro
//*****************************************************************************

//*****************************************************************************
// Tag
//*****************************************************************************

//*****************************************************************************
// Class
//*****************************************************************************
namespace Factory{

	//=============================================================================
	// FunctionName: CreateEntity
	// Param: void
	// ReturnValue: テンプレート型のポインタ
	// Content: 呼んだクラスの型のインスタンス生成してポインタとして返す
	//=============================================================================
	template <class T>
	inline T* Create(){

		// インスタンス生成
		T* entity = new T();

		// 生成したオブジェクトを返す
		return entity;

	}// Create
	//=============================================================================
	// FunctionName: CreateEntity
	// Param: void
	// ReturnValue: テンプレート型のポインタ
	// Content: 呼んだクラスの型のインスタンス生成してポインタとして返す
	//=============================================================================
	template <class T>
	inline T* Create(LPDIRECT3DDEVICE9 paramDevice){

		// インスタンス生成
		T* entity = new T(paramDevice);

		// 生成したオブジェクトを返す
		return entity;

	}// Create
	//=============================================================================
	// FunctionName: CreateEntity
	// Param: void
	// ReturnValue: テンプレート型のポインタ
	// Content: 呼んだクラスの型のインスタンス生成してポインタとして返す
	//=============================================================================
	template <class T>
	inline T* CreateArray(unsigned int paramCreateNum){

		// 0以下の場合nullを返す
		if (paramCreateNum <= 0){ return nullptr; }

		// インスタンス生成
		T* entity = new T[paramCreateNum]();

		// 生成したオブジェクトを返す
		return entity;

	}// Create
}
//*****************************************************************************
// IncludeGurd
//*****************************************************************************
#endif// _ENTITY_FACTORY_H_

// EOF