//=============================================================================
//
// kadai_XXXPlus [Renderer.h]
// 14/11/10
// Author : YOSHIKI ITOU
//
//=============================================================================
#ifndef _CRECDER_H_
#define _CRECDER_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <windows.h>
#include "../common.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Cform;							//前方宣言
class CCamera;

class CRenderer
{
	public:
		CRenderer(void);				//コンストラクタ
		~CRenderer(void);				//デストラクタ

		HRESULT Init(HWND hWnd,BOOL bWindow);	//初期化
		void Uninit(void);						//終了
		void Update(int nType);						//更新
		void Draw(int nType);						//描画
	private:
};

#endif

/////////////EOF////////////