//=============================================================================
//
// MS_BuildFight [CBackGround.cpp]
// 15/08/20
// Author : YOSHIKI ITOU
//
//=============================================================================
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#include "BackGround.h"
//*****************************************************************************
// 静的変数
//*****************************************************************************
const LPSTR CBackGround::m_apTextureName[]=
{
	"data/TEXTURE/Title.jpg",
	"data/TEXTURE/tutrial.jpg",
	"data/TEXTURE/Select.png",
	"data/TEXTURE/loading.jpg",
	"data/TEXTURE/Pause.jpg",
	"data/TEXTURE/GameClear.jpg",
	"data/TEXTURE/Vsend.jpg",
	"data/TEXTURE/Result.jpg"
};
//=============================================================================
// コンストラクタ
//=============================================================================
CBackGround :: CBackGround():Cform2D(OBJTYPE_PAUSE,7)
{
}
//=============================================================================
// デストラクタ
//=============================================================================
CBackGround :: ~CBackGround(void)
{
}
//=============================================================================
// CBackGround生成
//=============================================================================
CBackGround *CBackGround::Create(LPDIRECT3DDEVICE9 pDevice,BACKGROUNDTYPE Type)
{
	CBackGround *pform2D;

	pform2D = new CBackGround();
	pform2D->Init(pDevice,Type);

	return pform2D;
}
//=============================================================================
// 初期化
//=============================================================================
HRESULT CBackGround :: Init(LPDIRECT3DDEVICE9 pDevice,BACKGROUNDTYPE Type)
{
	m_pDevice = pDevice;
	//フィールドの初期化
	Cform2D::Init(m_pDevice,m_apTextureName[Type],D3DXVECTOR3(SCREEN_WIDTH/2,SCREEN_HEIGHT/2,0.0f),D3DXVECTOR3(0.0f,0.0f,0.0f),SCREEN_WIDTH,SCREEN_HEIGHT);
	return S_OK;
}
//=============================================================================
// 終了
//=============================================================================
void CBackGround :: Uninit(void)
{
	//様々なオブジェクトの終了（開放）処理
	Cform2D::Uninit();
}
//=============================================================================
// 更新
//=============================================================================
void CBackGround :: Update(void)
{
	Cform2D::Update();
}
//=============================================================================
// 描画
//=============================================================================
void CBackGround :: Draw(void)
{
	Cform2D::Draw();
}
/////////////EOF////////////