//=============================================================================
//
// MS_BuildFight [CLock.h]
// 15/08/20
// Author : YOSHIKI ITOU
//
//=============================================================================
#ifndef _CLOCK_H_
#define _CLOCK_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "../../form/formBillBoard.h"
//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLock  : public CformBillBoard
{
	public:
		CLock();//コンストラクタ
		~CLock(void);//デストラクタ

		static CLock *Create(LPDIRECT3DDEVICE9 pDevice,D3DXVECTOR3 pos,D3DXVECTOR3 rot);

		HRESULT Init(LPDIRECT3DDEVICE9 pDevice,D3DXVECTOR3 pos,D3DXVECTOR3 rot);//初期化
		void Uninit(void);//終了
		void Update(void);//更新
		void Draw(void);//描画

		void SetTextureNum(int change){m_nTextureNum=change;};

	private:
		LPDIRECT3DDEVICE9		m_pDevice;
		static const LPSTR		m_apTextureName[];
		int						m_nTextureNum;
};

#endif

/////////////EOF////////////