//=============================================================================
//
// MS_BuildFight [CLight.h]
// 15/08/20
// Author : YOSHIKI ITOU
//
//=============================================================================
#ifndef _CLIGHT_H_
#define _CLIGHT_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <windows.h>
#include "../../common.h"

#define SCENE_MAX	(10)

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CLight
{
	public:
		CLight(void);								//コンストラクタ
		~CLight(void);								//デストラクタ

		HRESULT Init(LPDIRECT3DDEVICE9 pDevice);	//初期化
		void Uninit(void);							//終了
		void Update(void);							//更新
		void Draw(void);							//描画

	private:
		D3DLIGHT9	m_Light[3];					//ライト情報
};
#endif

/////////////EOF////////////