//=============================================================================
//
// MS_BuildFight [CPGunNight1.h]
// 15/08/20
// Author : YOSHIKI ITOU
//
//=============================================================================
#ifndef _PGUNNIGHT1_H_
#define _PGUNNIGHT1_H_
//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "PlayerM.h"
//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CPGunNight1  : public CPlayerM
{
	public:
		CPGunNight1(int nPriority = 5);//コンストラクタ
		~CPGunNight1(void);//デストラクタ

		static CPGunNight1 *Create(LPDIRECT3DDEVICE9 pDevice,D3DXVECTOR3 pos, D3DXVECTOR3 rot,bool CPU);

		HRESULT Init(LPDIRECT3DDEVICE9 pDevice,D3DXVECTOR3 pos, D3DXVECTOR3 rot,bool CPU);//初期化
		void Uninit(void);//終了
		void Update(void);//更新
		void Draw(void);//描画
		void Restart(D3DXVECTOR3 pos,D3DXVECTOR3 rot);

	private:
};

#endif

/////////////EOF////////////